'''
作者: terry
创建日期: 
最后编辑时间: 
Description: 
路径: 
说明: 这是一个牛马(牛气冲天,马到成功)程序
'''
'''
作者: terry
创建日期: 
最后编辑时间: 
Description: 
路径: 
说明: 这是一个牛马(牛气冲天,马到成功)程序
'''
'''
                                                    __----~~~~~~~~~~~------___
                                   .  .   ~~//====......          __--~ ~~
                   -.            \_|//     |||\\  ~~~~~~::::... /~
                ___-==_       _-~o~  \/    |||  \\            _/~~-
        __---~~~.==~||\=_    -_--~/_-~|-   |\\   \\        _/~
    _-~~     .=~    |  \\-_    '-~7  /-   /  ||    \      /
  .~       .~       |   \\ -_    /  /-   /   ||      \   /
 /  ____  /         |     \\ ~-_/  /|- _/   .||       \ /
 |~~    ~~|--~~~~--_ \     ~==-/   | \~--===~~        .\
          '         ~-|      /|    |-~\~~       __--~~
                      |-~~-_/ |    |   ~\_   _-~            /\
                           /  \     \__   \/~                \__
                       _--~ _/ | .-~~____--~-/                  ~~==.
                      ((->/~   '.|||' -_|    ~~-/ ,              . _||
                                 -_     ~\      ~~---l__i__i__i--~~_/
                                 _-~-__   ~)  \--______________--~~
                               //.-~~~-~_--~- |-------~~~~~~~~
                                      //.-~~~--\
                      ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

                              神兽保佑            永无BUG
'''






# 导入 wonderLang 中的全部内容
from time import sleep
from wonderLang import *

# 复制粘贴
# 我找到了其中最重要的东西
# 而忽略了那些重复的东西


# 例子 1
# 画一个边长为 9 的 100 边形
# 提示, 往右旋转 3.6 度


# 根据例子 1 完成下面的任务
# 不会写的任务先记下来, 上课重点听
# --------
# 任务
# --------


# 任务 1
# 画一个边长为 2 的 1000 边形
# 提示, 往右旋转 0.36 度
# jump(-100,300)
# for i in range(1000):
#     forward(2)
#     right(0.36)
#     pass
# sleep(2)

# 任务 2
# 画一个边长 101 的正方形
# 提示, 往右旋转 90 度
# for i in range(4):
#     forward(101)
#     right(90)
#     pass
# 任务 3
# 画一个宽 100 高 50 的长方形
# 提示, 往右旋转 90 度
# for i in range(4):
#     forward(100)
#     right(90)
#     forward(50)
#     right(90)



# 任务 4
# 画一个边长为 65 的正六边形
# 提示, 往右旋转 60 度
# jump(-100,300)
# for i in range(6):
#     forward(65)
#     right(60)
#     pass

# 任务 5
# 画一个边长为 129 的正八边形
# 提示, 往右旋转 45 度
# jump(-100,300)
# for i in range(8):
#     forward(129)
#     right(45)
#     pass

# 任务 6
# 画一个边长为 69 的正十边形
# 提示, 往右旋转 36 度
jump(-100,300)
for i in range(10):
    forward(69)
    right(36)
    pass


# 任务 7
# 画一个边长为 49 的正十边形
# 提示, 往右旋转 36 度
jump(-100,300)
for i in range(10):
    forward(49)
    right(36)
    pass


# 任务 8
# 画一个边长为 59 的正十边形
# 提示, 往右旋转 36 度
# jump(-100,300)
# for i in range(10):
#     forward(59)
#     right(36)
#     pass


# ！！！ 不要删除或者注释
# pause 这行代码让窗口不消失
pause()