


# 练习 input


# Todo 1
# 程序开始运行之后，会有提示字符串： "请输入你的年龄："，完成输入；
# 之后在终端打印出，你的年龄为: xxx
# 示例：你的年龄为: 20
'''
print('请输入你的年龄')
age=input()
print('你的年龄是',age)
'''
# Todo 2
# 程序开始运行之后，会有提示字符串： "请输入你的年龄："，完成输入；
# 程序会根据你输入的年龄自动 + 1
# 之后在终端打印出，你明年的年龄为: xxx
# 示例：请输入你的年龄: 20 你明年的年龄为: 21
# print('请输入你的年龄')
# age=input()
# age=int(age)
# print('你明年的年龄是',age+1)

# Todo 3
# 程序开始运行之后，会有提示字符串： "请输入你的年龄："，完成输入；
# 程序会根据你输入的年龄自动计算你的出生日期
# 之后在终端打印出，你是 xxx 年出生的
# 示例：请输入你的年龄：20 你是 2001 年出生的。
# print('请输入你的年龄')
# age=input()
# age=int(age)
# print('你明年的年龄是',2022-age)

# Todo 4
# 程序开始运行之后，会有提示字符串： "请输入你的年龄："，完成输入；
# 之后会有第二次输入，会有提示字符串： "："，完成输入；
# 将年龄相加，打印出年龄总和
# print('请输入你的年龄')
# age=input()
# print('请输入你妈妈的年龄')
# age2=input()
# age=int(age)
# age2=int(age2)

# print('年林和',age+age2)

# Todo 5
# 程序开始运行之后，会有提示字符串： "："，完成输入；
# 之后会有第二次输入，会有提示字符串： "："，完成输入；
# 判断爸爸妈妈谁的年龄更大一些，假如爸爸是 36 岁，妈妈是 34 岁，输出爸爸比妈妈大 2 岁。



# print('请输入你爸爸的年龄')
# age=input()
# print('请输入你妈妈的年龄')
# age2=input()
# age=int(age)
# age2=int(age2)
# res=age2-age
# res=abs(res)
# if age>age2:
#     print('爸爸比妈妈大',res,'岁')
# else:
#     print('妈妈比爸爸大',res,'岁')
# Todo 6
# 程序开始运行之后，会有提示字符串： "："，完成输入；
# 之后在终端打印出，正方形周长为 xxx
# （正方形周长 = 边长 * 4）
# print('请输入正方形边长')
# res=input()
# res=int(res)
# print('正方形周长为',res*4)
# Todo 7
# 程序开始运行之后，会有提示字符串： "请输入正方形边长："，完成输入；
# 之后在终端打印出，正方形面积为 xxx
#（正方形面积 = 边长 *
# print('请输入正方形边长')
# res=input()
# res=int(res)
# print('正方形面积为',res**2)
# Todo 8
# 程序开始运行之后，会有提示字符串： "请输入长方形的长："，完成输入；
# 程序开始运行之后，会有提示字符串： "请输入长方形的宽："，完成输入；
# 之后在终端打印出， xxx
# （长方形周长 = 长 * 2 + 宽 * 2）
print('请输入长方形长')
re1=input()
re1=int(re1)
print('请输入长方形宽')
re2=input()
re2=int(re2)
print('长方形的周长',(re1+re2)*2)
# Todo 9
# 程序开始运行之后，会有提示字符串： "请输入长方形的长："，完成输入；
# 程序开始运行之后，会有提示字符串： "请输入长方形的宽："，完成输入；
# 之后在终端打印出，长方形的面积 xxx
# （长方形面积 = 长 * 宽）
print('请输入长方形长')
re1=input()
re1=int(re1)
print('请输入长方形宽')
re2=input()
re2=int(re2)
print('长方形的面积',re1*re2)
